src/geekbang-arch-design.org
#+title: 架构设计
#+options: num:nil


** [[https://time.geekbang.org/column/article/89668][开篇词 | 怎样成长为优秀的软件架构师？]]

开篇词 | 怎样成长为优秀的软件架构师？

** [[https://time.geekbang.org/column/article/90170][01 | 架构设计的宏观视角]]

01 | 架构设计的宏观视角

** [[https://time.geekbang.org/column/article/91007][02 | 大厦基石：无生有，有生万物]]

02 | 大厦基石：无生有，有生万物

** [[https://time.geekbang.org/column/article/91425][03 | 汇编：编程语言的诞生]]

03 | 汇编：编程语言的诞生

** [[https://time.geekbang.org/column/article/92419][04 | 编程语言的进化]]

04 | 编程语言的进化

** [[https://time.geekbang.org/column/article/93130][05 | 思考题解读：如何实现可自我迭代的计算机？]]

05 | 思考题解读：如何实现可自我迭代的计算机？

** [[https://time.geekbang.org/column/article/93315][06 | 操作系统进场]]

06 | 操作系统进场

** [[https://time.geekbang.org/column/article/93802][07 | 软件运行机制及内存管理]]

07 | 软件运行机制及内存管理

** [[https://time.geekbang.org/column/article/94486][08 | 操作系统内核与编程接口]]

08 | 操作系统内核与编程接口

** [[https://time.geekbang.org/column/article/94991][09 | 外存管理与文件系统]]

09 | 外存管理与文件系统

** [[https://time.geekbang.org/column/article/95660][10 | 输入和输出设备：交互的演进]]

10 | 输入和输出设备：交互的演进

** [[https://time.geekbang.org/column/article/96324][11 | 多任务：进程、线程与协程]]

11 | 多任务：进程、线程与协程

** [[https://time.geekbang.org/column/article/96994][12 | 进程内协同：同步、互斥与通讯]]

12 | 进程内协同：同步、互斥与通讯

** [[https://time.geekbang.org/column/article/97617][13 | 进程间的同步互斥、资源共享与通讯]]

13 | 进程间的同步互斥、资源共享与通讯

** [[https://time.geekbang.org/column/article/98406][14 | IP 网络：连接世界的桥梁]]

14 | IP 网络：连接世界的桥梁

** [[https://time.geekbang.org/column/article/99184][15 | 可编程的互联网世界]]

15 | 可编程的互联网世界

** [[https://time.geekbang.org/column/article/99636][16 | 安全管理：数字世界的守护]]

16 | 安全管理：数字世界的守护

** [[https://time.geekbang.org/column/article/100140][17 | 架构：需求分析 (上)]]

17 | 架构：需求分析 (上)

** [[https://time.geekbang.org/column/article/100930][18 | 架构：需求分析 (下) · 实战案例]]

18 | 架构：需求分析 (下) · 实战案例

** [[https://time.geekbang.org/column/article/101498][19 | 基础平台篇：回顾与总结]]

19 | 基础平台篇：回顾与总结

** [[https://time.geekbang.org/column/article/102260][20 | 桌面开发的宏观视角]]

20 | 桌面开发的宏观视角

** [[https://time.geekbang.org/column/article/104436][21 | 图形界面程序的框架]]

21 | 图形界面程序的框架

** [[https://time.geekbang.org/column/article/105356][22 | 桌面程序的架构建议]]

22 | 桌面程序的架构建议

** [[https://time.geekbang.org/column/article/106156][23 | Web开发：浏览器、小程序与PWA]]

23 | Web开发：浏览器、小程序与PWA

** [[https://time.geekbang.org/column/article/107128][24 | 跨平台与 Web 开发的建议]]

24 | 跨平台与 Web 开发的建议

** [[https://time.geekbang.org/column/article/107954][25 | 桌面开发的未来]]

25 | 桌面开发的未来

** [[https://time.geekbang.org/column/article/108887][26 | 实战（一）：怎么设计一个“画图”程序？]]

26 | 实战（一）：怎么设计一个“画图”程序？

** [[https://time.geekbang.org/column/article/109592][27 | 实战（二）：怎么设计一个“画图”程序？]]

27 | 实战（二）：怎么设计一个“画图”程序？

** [[https://time.geekbang.org/column/article/110460][28 | 实战（三）：怎么设计一个“画图”程序？]]

28 | 实战（三）：怎么设计一个“画图”程序？

