html/geekbang-arch-design.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>架构设计</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="dirtysalt" />
<link rel="shortcut icon" href="/themes/favicon.ico" /><link rel="stylesheet" type="text/css" href="/themes/simple.css"/></head>
<body>
<div id="content">
<h1 class="title">架构设计</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org20a9743">开篇词 | 怎样成长为优秀的软件架构师？</a></li>
<li><a href="#org634599b">01 | 架构设计的宏观视角</a></li>
<li><a href="#org0061338">02 | 大厦基石：无生有，有生万物</a></li>
<li><a href="#orgbc38b0f">03 | 汇编：编程语言的诞生</a></li>
<li><a href="#orgdfd3b41">04 | 编程语言的进化</a></li>
<li><a href="#orgfc889ae">05 | 思考题解读：如何实现可自我迭代的计算机？</a></li>
<li><a href="#org51f8335">06 | 操作系统进场</a></li>
<li><a href="#org25b7b42">07 | 软件运行机制及内存管理</a></li>
<li><a href="#orgb10d0af">08 | 操作系统内核与编程接口</a></li>
<li><a href="#org66ffb50">09 | 外存管理与文件系统</a></li>
<li><a href="#orgde471f2">10 | 输入和输出设备：交互的演进</a></li>
<li><a href="#org004c5e9">11 | 多任务：进程、线程与协程</a></li>
<li><a href="#org619f7ed">12 | 进程内协同：同步、互斥与通讯</a></li>
<li><a href="#org97e5439">13 | 进程间的同步互斥、资源共享与通讯</a></li>
<li><a href="#org604be2f">14 | IP 网络：连接世界的桥梁</a></li>
<li><a href="#orga4fceaa">15 | 可编程的互联网世界</a></li>
<li><a href="#orgac6482f">16 | 安全管理：数字世界的守护</a></li>
<li><a href="#orgd4d4e96">17 | 架构：需求分析 (上)</a></li>
<li><a href="#org3a0edac">18 | 架构：需求分析 (下) · 实战案例</a></li>
<li><a href="#org8256cb7">19 | 基础平台篇：回顾与总结</a></li>
<li><a href="#org3171bad">20 | 桌面开发的宏观视角</a></li>
<li><a href="#orgb0a73d0">21 | 图形界面程序的框架</a></li>
<li><a href="#org4a185e4">22 | 桌面程序的架构建议</a></li>
<li><a href="#org47e948d">23 | Web开发：浏览器、小程序与PWA</a></li>
<li><a href="#orga269409">24 | 跨平台与 Web 开发的建议</a></li>
<li><a href="#orgbc29653">25 | 桌面开发的未来</a></li>
<li><a href="#orgdc1e39d">26 | 实战（一）：怎么设计一个“画图”程序？</a></li>
<li><a href="#org7216714">27 | 实战（二）：怎么设计一个“画图”程序？</a></li>
<li><a href="#org1a5ce62">28 | 实战（三）：怎么设计一个“画图”程序？</a></li>
<li><a href="#orga342c2d">29 | 实战（四）：怎么设计一个“画图”程序？</a></li>
<li><a href="#org7b04c4a">30  | 实战（五）：怎么设计一个“画图”程序？</a></li>
<li><a href="#org3d20772">31 | 辅助界面元素的架构设计</a></li>
<li><a href="#org09cbbde">32 | 架构：系统的概要设计</a></li>
<li><a href="#org63b72a5">33 | 桌面开发篇：回顾与总结</a></li>
<li><a href="#org569373a">34 | 服务端开发的宏观视角</a></li>
<li><a href="#orgde78540">35 | 流量调度与负载均衡</a></li>
<li><a href="#org2f92379">36 | 业务状态与存储中间件</a></li>
<li><a href="#org1e8435f">37 | 键值存储与数据库</a></li>
<li><a href="#orgc80aa2e">38  | 文件系统与对象存储</a></li>
<li><a href="#org4a84fff">39  | 存储与缓存</a></li>
<li><a href="#orga61be93">40 | 服务端的业务架构建议</a></li>
<li><a href="#org7eaf526">41 | 实战（一）：“画图”程序后端实战</a></li>
<li><a href="#org8223aa3">42 | 实战（二）：“画图”程序后端实战</a></li>
<li><a href="#orgee85e46">43 | 实战（三）：“画图”程序后端实战</a></li>
<li><a href="#org7d66f50">44 | 实战（四）：“画图”程序后端实战</a></li>
<li><a href="#org134d74e">45 | 架构：怎么做详细设计？</a></li>
<li><a href="#orgf5618ae">46 | 服务端开发篇：回顾与总结</a></li>
<li><a href="#orgcac7af4">加餐 | 如何做HTTP服务的测试？</a></li>
<li><a href="#orgc5c86dc">47 | 服务治理的宏观视角</a></li>
<li><a href="#org993429e">48 | 事务与工程：什么是工程师思维？</a></li>
<li><a href="#org9930184">49 | 发布、升级与版本管理</a></li>
<li><a href="#org8a84a05">50 | 日志、监控与报警</a></li>
<li><a href="#org3378bce">加餐 | 怎么保障发布的效率与质量？</a></li>
<li><a href="#orgf22498f">51 | 故障域与故障预案</a></li>
<li><a href="#orgc07b461">52 | 故障排查与根因分析</a></li>
<li><a href="#org07021be">53 | 过载保护与容量规划</a></li>
<li><a href="#org8b33de9">54 | 业务的可支持性与持续运营</a></li>
<li><a href="#orge8c33bf">55 | 云计算、容器革命与服务端的未来</a></li>
<li><a href="#orgb8274e2">56 | 服务治理篇：回顾与总结</a></li>
<li><a href="#orga1c9dd4">57 | 心性：架构师的修炼之道</a></li>
<li><a href="#org901af00">58 | 如何判断架构设计的优劣？</a></li>
<li><a href="#org38a938b">59 | 少谈点框架，多谈点业务</a></li>
<li><a href="#org7650009">60 | 架构分解：边界，不断重新审视边界</a></li>
<li><a href="#orgc38937d">加餐 | 实战：“画图程序” 的整体架构</a></li>
<li><a href="#orgbb57856">61 | 全局性功能的架构设计</a></li>
<li><a href="#orga811bca">62 | 重新认识开闭原则 (OCP)</a></li>
<li><a href="#org57af880">63 | 接口设计的准则</a></li>
<li><a href="#orga60a4e7">64 | 不断完善的架构范式</a></li>
<li><a href="#orga0fc9b4">65 | 架构范式：文本处理</a></li>
<li><a href="#orge73252b">66 | 架构老化与重构</a></li>
<li><a href="#orgd0de3b7">67 | 架构思维篇：回顾与总结</a></li>
<li><a href="#org4611fa0">68 | 软件工程的宏观视角</a></li>
<li><a href="#orgb541be6">69 | 团队的共识管理</a></li>
<li><a href="#orgcc18039">70 | 怎么写设计文档？</a></li>
<li><a href="#orgaf2c778">71 | 如何阅读别人的代码？</a></li>
<li><a href="#orgb269873">72 | 发布单元与版本管理</a></li>
<li><a href="#org89fa6eb">73 | 软件质量管理：单元测试、持续构建与发布</a></li>
<li><a href="#orgd0f8db4">74 | 开源、云服务与外包管理</a></li>
<li><a href="#orgf9fbf16">75 | 软件版本迭代的规划</a></li>
<li><a href="#orgeb6605d">76 | 软件工程的未来</a></li>
<li><a href="#orge62e923">77 | 软件工程篇：回顾与总结</a></li>
<li><a href="#org5df280f">热点观察| 我看Facebook发币（上）：区块链、比特币与Libra币</a></li>
<li><a href="#org9084663">热点观察 | 我看Facebook发币（下）：深入浅出理解 Libra 币</a></li>
<li><a href="#orgf8a0120">课外阅读 | 从《孙子兵法》看底层的自然法则</a></li>
<li><a href="#orge50fa4f">答疑解惑 | 想当架构师，我需要成为“全才”吗？</a></li>
<li><a href="#org1190f7a">用户故事 | 站在更高的视角看架构</a></li>
<li><a href="#org5adf945">结束语 | 放下技术人的身段，用极限思维提升架构能力</a></li>
<li><a href="#org47f9e2f">结课问卷获奖用户名单</a></li>
</ul>
</div>
</div>


<div id="outline-container-org20a9743" class="outline-2">
<h2 id="org20a9743"><a href="https://time.geekbang.org/column/article/89668">开篇词 | 怎样成长为优秀的软件架构师？</a></h2>
<div class="outline-text-2" id="text-org20a9743">
<p>
开篇词 | 怎样成长为优秀的软件架构师？
</p>
</div>
</div>

<div id="outline-container-org634599b" class="outline-2">
<h2 id="org634599b"><a href="https://time.geekbang.org/column/article/90170">01 | 架构设计的宏观视角</a></h2>
<div class="outline-text-2" id="text-org634599b">
<p>
01 | 架构设计的宏观视角
</p>
</div>
</div>

<div id="outline-container-org0061338" class="outline-2">
<h2 id="org0061338"><a href="https://time.geekbang.org/column/article/91007">02 | 大厦基石：无生有，有生万物</a></h2>
<div class="outline-text-2" id="text-org0061338">
<p>
02 | 大厦基石：无生有，有生万物
</p>
</div>
</div>

<div id="outline-container-orgbc38b0f" class="outline-2">
<h2 id="orgbc38b0f"><a href="https://time.geekbang.org/column/article/91425">03 | 汇编：编程语言的诞生</a></h2>
<div class="outline-text-2" id="text-orgbc38b0f">
<p>
03 | 汇编：编程语言的诞生
</p>
</div>
</div>

<div id="outline-container-orgdfd3b41" class="outline-2">
<h2 id="orgdfd3b41"><a href="https://time.geekbang.org/column/article/92419">04 | 编程语言的进化</a></h2>
<div class="outline-text-2" id="text-orgdfd3b41">
<p>
04 | 编程语言的进化
</p>
</div>
</div>

<div id="outline-container-orgfc889ae" class="outline-2">
<h2 id="orgfc889ae"><a href="https://time.geekbang.org/column/article/93130">05 | 思考题解读：如何实现可自我迭代的计算机？</a></h2>
<div class="outline-text-2" id="text-orgfc889ae">
<p>
05 | 思考题解读：如何实现可自我迭代的计算机？
</p>
</div>
</div>

<div id="outline-container-org51f8335" class="outline-2">
<h2 id="org51f8335"><a href="https://time.geekbang.org/column/article/93315">06 | 操作系统进场</a></h2>
<div class="outline-text-2" id="text-org51f8335">
<p>
06 | 操作系统进场
</p>
</div>
</div>

<div id="outline-container-org25b7b42" class="outline-2">
<h2 id="org25b7b42"><a href="https://time.geekbang.org/column/article/93802">07 | 软件运行机制及内存管理</a></h2>
<div class="outline-text-2" id="text-org25b7b42">
<p>
07 | 软件运行机制及内存管理
</p>
</div>
</div>

<div id="outline-container-orgb10d0af" class="outline-2">
<h2 id="orgb10d0af"><a href="https://time.geekbang.org/column/article/94486">08 | 操作系统内核与编程接口</a></h2>
<div class="outline-text-2" id="text-orgb10d0af">
<p>
08 | 操作系统内核与编程接口
</p>
</div>
</div>

<div id="outline-container-org66ffb50" class="outline-2">
<h2 id="org66ffb50"><a href="https://time.geekbang.org/column/article/94991">09 | 外存管理与文件系统</a></h2>
<div class="outline-text-2" id="text-org66ffb50">
<p>
09 | 外存管理与文件系统
</p>
</div>
</div>

<div id="outline-container-orgde471f2" class="outline-2">
<h2 id="orgde471f2"><a href="https://time.geekbang.org/column/article/95660">10 | 输入和输出设备：交互的演进</a></h2>
<div class="outline-text-2" id="text-orgde471f2">
<p>
10 | 输入和输出设备：交互的演进
</p>
</div>
</div>

<div id="outline-container-org004c5e9" class="outline-2">
<h2 id="org004c5e9"><a href="https://time.geekbang.org/column/article/96324">11 | 多任务：进程、线程与协程</a></h2>
<div class="outline-text-2" id="text-org004c5e9">
<p>
11 | 多任务：进程、线程与协程
</p>
</div>
</div>

<div id="outline-container-org619f7ed" class="outline-2">
<h2 id="org619f7ed"><a href="https://time.geekbang.org/column/article/96994">12 | 进程内协同：同步、互斥与通讯</a></h2>
<div class="outline-text-2" id="text-org619f7ed">
<p>
12 | 进程内协同：同步、互斥与通讯
</p>
</div>
</div>

<div id="outline-container-org97e5439" class="outline-2">
<h2 id="org97e5439"><a href="https://time.geekbang.org/column/article/97617">13 | 进程间的同步互斥、资源共享与通讯</a></h2>
<div class="outline-text-2" id="text-org97e5439">
<p>
13 | 进程间的同步互斥、资源共享与通讯
</p>
</div>
</div>

<div id="outline-container-org604be2f" class="outline-2">
<h2 id="org604be2f"><a href="https://time.geekbang.org/column/article/98406">14 | IP 网络：连接世界的桥梁</a></h2>
<div class="outline-text-2" id="text-org604be2f">
<p>
14 | IP 网络：连接世界的桥梁
</p>
</div>
</div>

<div id="outline-container-orga4fceaa" class="outline-2">
<h2 id="orga4fceaa"><a href="https://time.geekbang.org/column/article/99184">15 | 可编程的互联网世界</a></h2>
<div class="outline-text-2" id="text-orga4fceaa">
<p>
15 | 可编程的互联网世界
</p>
</div>
</div>

<div id="outline-container-orgac6482f" class="outline-2">
<h2 id="orgac6482f"><a href="https://time.geekbang.org/column/article/99636">16 | 安全管理：数字世界的守护</a></h2>
<div class="outline-text-2" id="text-orgac6482f">
<p>
16 | 安全管理：数字世界的守护
</p>
</div>
</div>

<div id="outline-container-orgd4d4e96" class="outline-2">
<h2 id="orgd4d4e96"><a href="https://time.geekbang.org/column/article/100140">17 | 架构：需求分析 (上)</a></h2>
<div class="outline-text-2" id="text-orgd4d4e96">
<p>
17 | 架构：需求分析 (上)
</p>
</div>
</div>

<div id="outline-container-org3a0edac" class="outline-2">
<h2 id="org3a0edac"><a href="https://time.geekbang.org/column/article/100930">18 | 架构：需求分析 (下) · 实战案例</a></h2>
<div class="outline-text-2" id="text-org3a0edac">
<p>
18 | 架构：需求分析 (下) · 实战案例
</p>
</div>
</div>

<div id="outline-container-org8256cb7" class="outline-2">
<h2 id="org8256cb7"><a href="https://time.geekbang.org/column/article/101498">19 | 基础平台篇：回顾与总结</a></h2>
<div class="outline-text-2" id="text-org8256cb7">
<p>
19 | 基础平台篇：回顾与总结
</p>
</div>
</div>

<div id="outline-container-org3171bad" class="outline-2">
<h2 id="org3171bad"><a href="https://time.geekbang.org/column/article/102260">20 | 桌面开发的宏观视角</a></h2>
<div class="outline-text-2" id="text-org3171bad">
<p>
20 | 桌面开发的宏观视角
</p>
</div>
</div>

<div id="outline-container-orgb0a73d0" class="outline-2">
<h2 id="orgb0a73d0"><a href="https://time.geekbang.org/column/article/104436">21 | 图形界面程序的框架</a></h2>
<div class="outline-text-2" id="text-orgb0a73d0">
<p>
21 | 图形界面程序的框架
</p>
</div>
</div>

<div id="outline-container-org4a185e4" class="outline-2">
<h2 id="org4a185e4"><a href="https://time.geekbang.org/column/article/105356">22 | 桌面程序的架构建议</a></h2>
<div class="outline-text-2" id="text-org4a185e4">
<p>
22 | 桌面程序的架构建议
</p>
</div>
</div>

<div id="outline-container-org47e948d" class="outline-2">
<h2 id="org47e948d"><a href="https://time.geekbang.org/column/article/106156">23 | Web开发：浏览器、小程序与PWA</a></h2>
<div class="outline-text-2" id="text-org47e948d">
<p>
23 | Web开发：浏览器、小程序与PWA
</p>
</div>
</div>

<div id="outline-container-orga269409" class="outline-2">
<h2 id="orga269409"><a href="https://time.geekbang.org/column/article/107128">24 | 跨平台与 Web 开发的建议</a></h2>
<div class="outline-text-2" id="text-orga269409">
<p>
24 | 跨平台与 Web 开发的建议
</p>
</div>
</div>

<div id="outline-container-orgbc29653" class="outline-2">
<h2 id="orgbc29653"><a href="https://time.geekbang.org/column/article/107954">25 | 桌面开发的未来</a></h2>
<div class="outline-text-2" id="text-orgbc29653">
<p>
25 | 桌面开发的未来
</p>
</div>
</div>

<div id="outline-container-orgdc1e39d" class="outline-2">
<h2 id="orgdc1e39d"><a href="https://time.geekbang.org/column/article/108887">26 | 实战（一）：怎么设计一个“画图”程序？</a></h2>
<div class="outline-text-2" id="text-orgdc1e39d">
<p>
26 | 实战（一）：怎么设计一个“画图”程序？
</p>
</div>
</div>

<div id="outline-container-org7216714" class="outline-2">
<h2 id="org7216714"><a href="https://time.geekbang.org/column/article/109592">27 | 实战（二）：怎么设计一个“画图”程序？</a></h2>
<div class="outline-text-2" id="text-org7216714">
<p>
27 | 实战（二）：怎么设计一个“画图”程序？
</p>
</div>
</div>

<div id="outline-container-org1a5ce62" class="outline-2">
<h2 id="org1a5ce62"><a href="https://time.geekbang.org/column/article/110460">28 | 实战（三）：怎么设计一个“画图”程序？</a></h2>
<div class="outline-text-2" id="text-org1a5ce62">
<p>
28 | 实战（三）：怎么设计一个“画图”程序？
</p>
</div>
</div>
