src/geekbang-arch-design.org
** [[https://time.geekbang.org/column/article/111289][29 | 实战（四）：怎么设计一个“画图”程序？]]

29 | 实战（四）：怎么设计一个“画图”程序？

** [[https://time.geekbang.org/column/article/112106][30  | 实战（五）：怎么设计一个“画图”程序？]]

30  | 实战（五）：怎么设计一个“画图”程序？

** [[https://time.geekbang.org/column/article/113569][31 | 辅助界面元素的架构设计]]

31 | 辅助界面元素的架构设计

** [[https://time.geekbang.org/column/article/117783][32 | 架构：系统的概要设计]]

32 | 架构：系统的概要设计

** [[https://time.geekbang.org/column/article/118674][33 | 桌面开发篇：回顾与总结]]

33 | 桌面开发篇：回顾与总结

** [[https://time.geekbang.org/column/article/120049][34 | 服务端开发的宏观视角]]

34 | 服务端开发的宏观视角

** [[https://time.geekbang.org/column/article/125952][35 | 流量调度与负载均衡]]

35 | 流量调度与负载均衡

** [[https://time.geekbang.org/column/article/127490][36 | 业务状态与存储中间件]]

36 | 业务状态与存储中间件

** [[https://time.geekbang.org/column/article/129097][37 | 键值存储与数据库]]

37 | 键值存储与数据库

** [[https://time.geekbang.org/column/article/131310][38  | 文件系统与对象存储]]

38  | 文件系统与对象存储

** [[https://time.geekbang.org/column/article/132656][39  | 存储与缓存]]

39  | 存储与缓存

** [[https://time.geekbang.org/column/article/134384][40 | 服务端的业务架构建议]]

40 | 服务端的业务架构建议

** [[https://time.geekbang.org/column/article/135789][41 | 实战（一）：“画图”程序后端实战]]

41 | 实战（一）：“画图”程序后端实战

** [[https://time.geekbang.org/column/article/136884][42 | 实战（二）：“画图”程序后端实战]]

42 | 实战（二）：“画图”程序后端实战

** [[https://time.geekbang.org/column/article/138400][43 | 实战（三）：“画图”程序后端实战]]

43 | 实战（三）：“画图”程序后端实战

** [[https://time.geekbang.org/column/article/140069][44 | 实战（四）：“画图”程序后端实战]]

44 | 实战（四）：“画图”程序后端实战

** [[https://time.geekbang.org/column/article/142032][45 | 架构：怎么做详细设计？]]

45 | 架构：怎么做详细设计？

** [[https://time.geekbang.org/column/article/144263][46 | 服务端开发篇：回顾与总结]]

46 | 服务端开发篇：回顾与总结

** [[https://time.geekbang.org/column/article/144801][加餐 | 如何做HTTP服务的测试？]]

加餐 | 如何做HTTP服务的测试？

** [[https://time.geekbang.org/column/article/144803][47 | 服务治理的宏观视角]]

47 | 服务治理的宏观视角

** [[https://time.geekbang.org/column/article/148208][48 | 事务与工程：什么是工程师思维？]]

48 | 事务与工程：什么是工程师思维？

** [[https://time.geekbang.org/column/article/150346][49 | 发布、升级与版本管理]]

49 | 发布、升级与版本管理

** [[https://time.geekbang.org/column/article/152342][50 | 日志、监控与报警]]

50 | 日志、监控与报警

** [[https://time.geekbang.org/column/article/154246][加餐 | 怎么保障发布的效率与质量？]]

加餐 | 怎么保障发布的效率与质量？

** [[https://time.geekbang.org/column/article/155500][51 | 故障域与故障预案]]

51 | 故障域与故障预案

** [[https://time.geekbang.org/column/article/157416][52 | 故障排查与根因分析]]

52 | 故障排查与根因分析

** [[https://time.geekbang.org/column/article/159848][53 | 过载保护与容量规划]]

53 | 过载保护与容量规划

** [[https://time.geekbang.org/column/article/161467][54 | 业务的可支持性与持续运营]]

54 | 业务的可支持性与持续运营

** [[https://time.geekbang.org/column/article/163112][55 | 云计算、容器革命与服务端的未来]]

55 | 云计算、容器革命与服务端的未来

** [[https://time.geekbang.org/column/article/164623][56 | 服务治理篇：回顾与总结]]

56 | 服务治理篇：回顾与总结

** [[https://time.geekbang.org/column/article/166014][57 | 心性：架构师的修炼之道]]

57 | 心性：架构师的修炼之道

** [[https://time.geekbang.org/column/article/167844][58 | 如何判断架构设计的优劣？]]

58 | 如何判断架构设计的优劣？

** [[https://time.geekbang.org/column/article/169113][59 | 少谈点框架，多谈点业务]]

59 | 少谈点框架，多谈点业务

** [[https://time.geekbang.org/column/article/170912][60 | 架构分解：边界，不断重新审视边界]]

60 | 架构分解：边界，不断重新审视边界

** [[https://time.geekbang.org/column/article/172004][加餐 | 实战：“画图程序” 的整体架构]]

加餐 | 实战：“画图程序” 的整体架构

** [[https://time.geekbang.org/column/article/173619][61 | 全局性功能的架构设计]]

61 | 全局性功能的架构设计

** [[https://time.geekbang.org/column/article/175236][62 | 重新认识开闭原则 (OCP)]]

62 | 重新认识开闭原则 (OCP)

** [[https://time.geekbang.org/column/article/176852][63 | 接口设计的准则]]

63 | 接口设计的准则

** [[https://time.geekbang.org/column/article/177746][64 | 不断完善的架构范式]]

64 | 不断完善的架构范式

** [[https://time.geekbang.org/column/article/178874][65 | 架构范式：文本处理]]

65 | 架构范式：文本处理

** [[https://time.geekbang.org/column/article/180396][66 | 架构老化与重构]]

66 | 架构老化与重构

** [[https://time.geekbang.org/column/article/181599][67 | 架构思维篇：回顾与总结]]

67 | 架构思维篇：回顾与总结

** [[https://time.geekbang.org/column/article/182924][68 | 软件工程的宏观视角]]

68 | 软件工程的宏观视角

** [[https://time.geekbang.org/column/article/183900][69 | 团队的共识管理]]

69 | 团队的共识管理

** [[https://time.geekbang.org/column/article/185234][70 | 怎么写设计文档？]]

70 | 怎么写设计文档？

** [[https://time.geekbang.org/column/article/186399][71 | 如何阅读别人的代码？]]

71 | 如何阅读别人的代码？

** [[https://time.geekbang.org/column/article/187641][72 | 发布单元与版本管理]]

72 | 发布单元与版本管理

