html/geekbang-arch-design.html

<div id="outline-container-orga342c2d" class="outline-2">
<h2 id="orga342c2d"><a href="https://time.geekbang.org/column/article/111289">29 | 实战（四）：怎么设计一个“画图”程序？</a></h2>
<div class="outline-text-2" id="text-orga342c2d">
<p>
29 | 实战（四）：怎么设计一个“画图”程序？
</p>
</div>
</div>

<div id="outline-container-org7b04c4a" class="outline-2">
<h2 id="org7b04c4a"><a href="https://time.geekbang.org/column/article/112106">30  | 实战（五）：怎么设计一个“画图”程序？</a></h2>
<div class="outline-text-2" id="text-org7b04c4a">
<p>
30  | 实战（五）：怎么设计一个“画图”程序？
</p>
</div>
</div>

<div id="outline-container-org3d20772" class="outline-2">
<h2 id="org3d20772"><a href="https://time.geekbang.org/column/article/113569">31 | 辅助界面元素的架构设计</a></h2>
<div class="outline-text-2" id="text-org3d20772">
<p>
31 | 辅助界面元素的架构设计
</p>
</div>
</div>

<div id="outline-container-org09cbbde" class="outline-2">
<h2 id="org09cbbde"><a href="https://time.geekbang.org/column/article/117783">32 | 架构：系统的概要设计</a></h2>
<div class="outline-text-2" id="text-org09cbbde">
<p>
32 | 架构：系统的概要设计
</p>
</div>
</div>

<div id="outline-container-org63b72a5" class="outline-2">
<h2 id="org63b72a5"><a href="https://time.geekbang.org/column/article/118674">33 | 桌面开发篇：回顾与总结</a></h2>
<div class="outline-text-2" id="text-org63b72a5">
<p>
33 | 桌面开发篇：回顾与总结
</p>
</div>
</div>

<div id="outline-container-org569373a" class="outline-2">
<h2 id="org569373a"><a href="https://time.geekbang.org/column/article/120049">34 | 服务端开发的宏观视角</a></h2>
<div class="outline-text-2" id="text-org569373a">
<p>
34 | 服务端开发的宏观视角
</p>
</div>
</div>

<div id="outline-container-orgde78540" class="outline-2">
<h2 id="orgde78540"><a href="https://time.geekbang.org/column/article/125952">35 | 流量调度与负载均衡</a></h2>
<div class="outline-text-2" id="text-orgde78540">
<p>
35 | 流量调度与负载均衡
</p>
</div>
</div>

<div id="outline-container-org2f92379" class="outline-2">
<h2 id="org2f92379"><a href="https://time.geekbang.org/column/article/127490">36 | 业务状态与存储中间件</a></h2>
<div class="outline-text-2" id="text-org2f92379">
<p>
36 | 业务状态与存储中间件
</p>
</div>
</div>

<div id="outline-container-org1e8435f" class="outline-2">
<h2 id="org1e8435f"><a href="https://time.geekbang.org/column/article/129097">37 | 键值存储与数据库</a></h2>
<div class="outline-text-2" id="text-org1e8435f">
<p>
37 | 键值存储与数据库
</p>
</div>
</div>

<div id="outline-container-orgc80aa2e" class="outline-2">
<h2 id="orgc80aa2e"><a href="https://time.geekbang.org/column/article/131310">38  | 文件系统与对象存储</a></h2>
<div class="outline-text-2" id="text-orgc80aa2e">
<p>
38  | 文件系统与对象存储
</p>
</div>
</div>

<div id="outline-container-org4a84fff" class="outline-2">
<h2 id="org4a84fff"><a href="https://time.geekbang.org/column/article/132656">39  | 存储与缓存</a></h2>
<div class="outline-text-2" id="text-org4a84fff">
<p>
39  | 存储与缓存
</p>
</div>
</div>

<div id="outline-container-orga61be93" class="outline-2">
<h2 id="orga61be93"><a href="https://time.geekbang.org/column/article/134384">40 | 服务端的业务架构建议</a></h2>
<div class="outline-text-2" id="text-orga61be93">
<p>
40 | 服务端的业务架构建议
</p>
</div>
</div>

<div id="outline-container-org7eaf526" class="outline-2">
<h2 id="org7eaf526"><a href="https://time.geekbang.org/column/article/135789">41 | 实战（一）：“画图”程序后端实战</a></h2>
<div class="outline-text-2" id="text-org7eaf526">
<p>
41 | 实战（一）：“画图”程序后端实战
</p>
</div>
</div>

<div id="outline-container-org8223aa3" class="outline-2">
<h2 id="org8223aa3"><a href="https://time.geekbang.org/column/article/136884">42 | 实战（二）：“画图”程序后端实战</a></h2>
<div class="outline-text-2" id="text-org8223aa3">
<p>
42 | 实战（二）：“画图”程序后端实战
</p>
</div>
</div>

<div id="outline-container-orgee85e46" class="outline-2">
<h2 id="orgee85e46"><a href="https://time.geekbang.org/column/article/138400">43 | 实战（三）：“画图”程序后端实战</a></h2>
<div class="outline-text-2" id="text-orgee85e46">
<p>
43 | 实战（三）：“画图”程序后端实战
</p>
</div>
</div>

<div id="outline-container-org7d66f50" class="outline-2">
<h2 id="org7d66f50"><a href="https://time.geekbang.org/column/article/140069">44 | 实战（四）：“画图”程序后端实战</a></h2>
<div class="outline-text-2" id="text-org7d66f50">
<p>
44 | 实战（四）：“画图”程序后端实战
</p>
</div>
</div>

<div id="outline-container-org134d74e" class="outline-2">
<h2 id="org134d74e"><a href="https://time.geekbang.org/column/article/142032">45 | 架构：怎么做详细设计？</a></h2>
<div class="outline-text-2" id="text-org134d74e">
<p>
45 | 架构：怎么做详细设计？
</p>
</div>
</div>

<div id="outline-container-orgf5618ae" class="outline-2">
<h2 id="orgf5618ae"><a href="https://time.geekbang.org/column/article/144263">46 | 服务端开发篇：回顾与总结</a></h2>
<div class="outline-text-2" id="text-orgf5618ae">
<p>
46 | 服务端开发篇：回顾与总结
</p>
</div>
</div>

<div id="outline-container-orgcac7af4" class="outline-2">
<h2 id="orgcac7af4"><a href="https://time.geekbang.org/column/article/144801">加餐 | 如何做HTTP服务的测试？</a></h2>
<div class="outline-text-2" id="text-orgcac7af4">
<p>
加餐 | 如何做HTTP服务的测试？
</p>
</div>
</div>

<div id="outline-container-orgc5c86dc" class="outline-2">
<h2 id="orgc5c86dc"><a href="https://time.geekbang.org/column/article/144803">47 | 服务治理的宏观视角</a></h2>
<div class="outline-text-2" id="text-orgc5c86dc">
<p>
47 | 服务治理的宏观视角
</p>
</div>
</div>

<div id="outline-container-org993429e" class="outline-2">
<h2 id="org993429e"><a href="https://time.geekbang.org/column/article/148208">48 | 事务与工程：什么是工程师思维？</a></h2>
<div class="outline-text-2" id="text-org993429e">
<p>
48 | 事务与工程：什么是工程师思维？
</p>
</div>
</div>

<div id="outline-container-org9930184" class="outline-2">
<h2 id="org9930184"><a href="https://time.geekbang.org/column/article/150346">49 | 发布、升级与版本管理</a></h2>
<div class="outline-text-2" id="text-org9930184">
<p>
49 | 发布、升级与版本管理
</p>
</div>
</div>

<div id="outline-container-org8a84a05" class="outline-2">
<h2 id="org8a84a05"><a href="https://time.geekbang.org/column/article/152342">50 | 日志、监控与报警</a></h2>
<div class="outline-text-2" id="text-org8a84a05">
<p>
50 | 日志、监控与报警
</p>
</div>
</div>

<div id="outline-container-org3378bce" class="outline-2">
<h2 id="org3378bce"><a href="https://time.geekbang.org/column/article/154246">加餐 | 怎么保障发布的效率与质量？</a></h2>
<div class="outline-text-2" id="text-org3378bce">
<p>
加餐 | 怎么保障发布的效率与质量？
</p>
</div>
</div>

<div id="outline-container-orgf22498f" class="outline-2">
<h2 id="orgf22498f"><a href="https://time.geekbang.org/column/article/155500">51 | 故障域与故障预案</a></h2>
<div class="outline-text-2" id="text-orgf22498f">
<p>
51 | 故障域与故障预案
</p>
</div>
</div>

<div id="outline-container-orgc07b461" class="outline-2">
<h2 id="orgc07b461"><a href="https://time.geekbang.org/column/article/157416">52 | 故障排查与根因分析</a></h2>
<div class="outline-text-2" id="text-orgc07b461">
<p>
52 | 故障排查与根因分析
</p>
</div>
</div>

<div id="outline-container-org07021be" class="outline-2">
<h2 id="org07021be"><a href="https://time.geekbang.org/column/article/159848">53 | 过载保护与容量规划</a></h2>
<div class="outline-text-2" id="text-org07021be">
<p>
53 | 过载保护与容量规划
</p>
</div>
</div>

<div id="outline-container-org8b33de9" class="outline-2">
<h2 id="org8b33de9"><a href="https://time.geekbang.org/column/article/161467">54 | 业务的可支持性与持续运营</a></h2>
<div class="outline-text-2" id="text-org8b33de9">
<p>
54 | 业务的可支持性与持续运营
</p>
</div>
</div>

<div id="outline-container-orge8c33bf" class="outline-2">
<h2 id="orge8c33bf"><a href="https://time.geekbang.org/column/article/163112">55 | 云计算、容器革命与服务端的未来</a></h2>
<div class="outline-text-2" id="text-orge8c33bf">
<p>
55 | 云计算、容器革命与服务端的未来
</p>
</div>
</div>

<div id="outline-container-orgb8274e2" class="outline-2">
<h2 id="orgb8274e2"><a href="https://time.geekbang.org/column/article/164623">56 | 服务治理篇：回顾与总结</a></h2>
<div class="outline-text-2" id="text-orgb8274e2">
<p>
56 | 服务治理篇：回顾与总结
</p>
</div>
</div>

<div id="outline-container-orga1c9dd4" class="outline-2">
<h2 id="orga1c9dd4"><a href="https://time.geekbang.org/column/article/166014">57 | 心性：架构师的修炼之道</a></h2>
<div class="outline-text-2" id="text-orga1c9dd4">
<p>
57 | 心性：架构师的修炼之道
</p>
</div>
</div>

<div id="outline-container-org901af00" class="outline-2">
<h2 id="org901af00"><a href="https://time.geekbang.org/column/article/167844">58 | 如何判断架构设计的优劣？</a></h2>
<div class="outline-text-2" id="text-org901af00">
<p>
58 | 如何判断架构设计的优劣？
</p>
</div>
</div>

<div id="outline-container-org38a938b" class="outline-2">
<h2 id="org38a938b"><a href="https://time.geekbang.org/column/article/169113">59 | 少谈点框架，多谈点业务</a></h2>
<div class="outline-text-2" id="text-org38a938b">
<p>
59 | 少谈点框架，多谈点业务
</p>
</div>
</div>

<div id="outline-container-org7650009" class="outline-2">
<h2 id="org7650009"><a href="https://time.geekbang.org/column/article/170912">60 | 架构分解：边界，不断重新审视边界</a></h2>
<div class="outline-text-2" id="text-org7650009">
<p>
60 | 架构分解：边界，不断重新审视边界
</p>
</div>
</div>
